Voting and attendance updated
